
# State **`s3://foo-bucket/path/to/key.state`**
## Affected resources counts

|  Success  |   🟢 Add |   🟡 Change |   🔴 Destroy |
|:---------:|--------:|-----------:|------------:|
|     ✅     |       2 |          1 |           2 |
## Affected resources by action

|  Action  | Resources                                                                |
|:--------:|:-------------------------------------------------------------------------|
|    🟢     | `module.repos["test"].github_repository.repo`                            |
|    🟢     | `module.repos["test"].github_team_repository.dev`                        |
|    🟡     | `module.repos["infrahouse-toolkit"].github_repository.repo`              |
|    🔴     | `module.repos["cookiecutter-github-control"].github_repository.repo`     |
|    🔴     | `module.repos["cookiecutter-github-control"].github_team_repository.dev` |
<details>
<summary>STDOUT</summary>

```terraform init
Initializing modules...

Initializing the backend...

Initializing provider plugins...
- Reusing previous version of hashicorp/aws from the dependency lock file
- Reusing previous version of integrations/github from the dependency lock file
- Using previously-installed hashicorp/aws v4.54.0
- Using previously-installed integrations/github v5.17.0

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
terraform plan -var-file=configuration.tfvars --out=tf.plan
aws_secretsmanager_secret.pypi_api_token: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__PYPI_API_TOKEN-dhII9P]
data.aws_secretsmanager_secret_version.pypi_api_token: Reading...
github_membership.infrahouse["akuzminsky"]: Refreshing state... [id=infrahouse:akuzminsky]
github_team.dev: Refreshing state... [id=7332815]
github_organization_settings.infrahouse: Refreshing state... [id=121984263]
data.aws_secretsmanager_secret_version.pypi_api_token: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__PYPI_API_TOKEN-dhII9P|AWSCURRENT]
github_actions_secret.pypi_api_token["infrahouse-toolkit"]: Refreshing state... [id=infrahouse-toolkit:PYPI_API_TOKEN]
module.repos["infrahouse-toolkit"].github_repository.repo: Refreshing state... [id=infrahouse-toolkit]
module.repos["cookiecutter-github-control"].github_repository.repo: Refreshing state... [id=cookiecutter-github-control]
github_team_members.dev: Refreshing state... [id=7332815]
module.repos["infrahouse-toolkit"].github_team_repository.dev: Refreshing state... [id=7332815:infrahouse-toolkit]
module.repos["cookiecutter-github-control"].github_team_repository.dev: Refreshing state... [id=7332815:cookiecutter-github-control]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.repos["cookiecutter-github-control"].github_repository.repo will be destroyed
  # (because module.repos["cookiecutter-github-control"] is not in configuration)
  - resource "github_repository" "repo" {
      - allow_auto_merge            = false -> null
      - allow_merge_commit          = true -> null
      - allow_rebase_merge          = true -> null
      - allow_squash_merge          = true -> null
      - allow_update_branch         = false -> null
      - archived                    = false -> null
      - default_branch              = "main" -> null
      - delete_branch_on_merge      = false -> null
      - description                 = "Template for a GitHub Control repository" -> null
      - etag                        = "W/\"8b4a792bc1474d381caaa63b76668993b4adc42ae76ed53d6886d8562ebb0c67\"" -> null
      - full_name                   = "infrahouse/cookiecutter-github-control" -> null
      - git_clone_url               = "git://github.com/infrahouse/cookiecutter-github-control.git" -> null
      - has_discussions             = false -> null
      - has_downloads               = false -> null
      - has_issues                  = true -> null
      - has_projects                = false -> null
      - has_wiki                    = false -> null
      - html_url                    = "https://github.com/infrahouse/cookiecutter-github-control" -> null
      - http_clone_url              = "https://github.com/infrahouse/cookiecutter-github-control.git" -> null
      - id                          = "cookiecutter-github-control" -> null
      - is_template                 = false -> null
      - merge_commit_message        = "PR_TITLE" -> null
      - merge_commit_title          = "MERGE_MESSAGE" -> null
      - name                        = "cookiecutter-github-control" -> null
      - node_id                     = "R_kgDOI528zg" -> null
      - private                     = false -> null
      - repo_id                     = 597540046 -> null
      - squash_merge_commit_message = "COMMIT_MESSAGES" -> null
      - squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> null
      - ssh_clone_url               = "git@github.com:infrahouse/cookiecutter-github-control.git" -> null
      - svn_url                     = "https://github.com/infrahouse/cookiecutter-github-control" -> null
      - topics                      = [] -> null
      - visibility                  = "public" -> null
      - vulnerability_alerts        = false -> null

      - security_and_analysis {

          - secret_scanning {
              - status = "disabled" -> null
            }

          - secret_scanning_push_protection {
              - status = "disabled" -> null
            }
        }
    }

  # module.repos["cookiecutter-github-control"].github_team_repository.dev will be destroyed
  # (because module.repos["cookiecutter-github-control"] is not in configuration)
  - resource "github_team_repository" "dev" {
      - etag       = "W/\"8043f81b19693f6c1a72d21bb8dc03859c98bf78bfbe79782bfe13fa813992ca\"" -> null
      - id         = "7332815:cookiecutter-github-control" -> null
      - permission = "push" -> null
      - repository = "cookiecutter-github-control" -> null
      - team_id    = "7332815" -> null
    }

  # module.repos["infrahouse-toolkit"].github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
      ~ description                 = "InfraHouse Toolkit" -> "InfraHouse Toolkit1"
        id                          = "infrahouse-toolkit"
        name                        = "infrahouse-toolkit"
        # (31 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repos["test"].github_repository.repo will be created
  + resource "github_repository" "repo" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = false
      + description                 = "Template for a GitHub Control repository"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "test"
      + node_id                     = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + visibility                  = "public"

      + security_and_analysis {
          + advanced_security {
              + status = (known after apply)
            }

          + secret_scanning {
              + status = (known after apply)
            }

          + secret_scanning_push_protection {
              + status = (known after apply)
            }
        }
    }

  # module.repos["test"].github_team_repository.dev will be created
  + resource "github_team_repository" "dev" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "test"
      + team_id    = "7332815"
    }

Plan: 2 to add, 1 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details>
<summary>STDERR</summary>

```no output```
</details>
<details><summary><i>metadata</i></summary>
<p>
```eyJzMzovL2Zvby1idWNrZXQvcGF0aC90by9rZXkuc3RhdGUiOiB7InN1Y2Nlc3MiOiB0cnVlLCAic3Rkb3V0IjogInRlcnJhZm9ybSBpbml0XG5cdTAwMWJbMG1cdTAwMWJbMW1Jbml0aWFsaXppbmcgbW9kdWxlcy4uLlx1MDAxYlswbVxuXG5cdTAwMWJbMG1cdTAwMWJbMW1Jbml0aWFsaXppbmcgdGhlIGJhY2tlbmQuLi5cdTAwMWJbMG1cblxuXHUwMDFiWzBtXHUwMDFiWzFtSW5pdGlhbGl6aW5nIHByb3ZpZGVyIHBsdWdpbnMuLi5cdTAwMWJbMG1cbi0gUmV1c2luZyBwcmV2aW91cyB2ZXJzaW9uIG9mIGhhc2hpY29ycC9hd3MgZnJvbSB0aGUgZGVwZW5kZW5jeSBsb2NrIGZpbGVcbi0gUmV1c2luZyBwcmV2aW91cyB2ZXJzaW9uIG9mIGludGVncmF0aW9ucy9naXRodWIgZnJvbSB0aGUgZGVwZW5kZW5jeSBsb2NrIGZpbGVcbi0gVXNpbmcgcHJldmlvdXNseS1pbnN0YWxsZWQgaGFzaGljb3JwL2F3cyB2NC41NC4wXG4tIFVzaW5nIHByZXZpb3VzbHktaW5zdGFsbGVkIGludGVncmF0aW9ucy9naXRodWIgdjUuMTcuMFxuXG5cdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMzJtVGVycmFmb3JtIGhhcyBiZWVuIHN1Y2Nlc3NmdWxseSBpbml0aWFsaXplZCFcdTAwMWJbMG1cdTAwMWJbMzJtXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMzJtXG5Zb3UgbWF5IG5vdyBiZWdpbiB3b3JraW5nIHdpdGggVGVycmFmb3JtLiBUcnkgcnVubmluZyBcInRlcnJhZm9ybSBwbGFuXCIgdG8gc2VlXG5hbnkgY2hhbmdlcyB0aGF0IGFyZSByZXF1aXJlZCBmb3IgeW91ciBpbmZyYXN0cnVjdHVyZS4gQWxsIFRlcnJhZm9ybSBjb21tYW5kc1xuc2hvdWxkIG5vdyB3b3JrLlxuXG5JZiB5b3UgZXZlciBzZXQgb3IgY2hhbmdlIG1vZHVsZXMgb3IgYmFja2VuZCBjb25maWd1cmF0aW9uIGZvciBUZXJyYWZvcm0sXG5yZXJ1biB0aGlzIGNvbW1hbmQgdG8gcmVpbml0aWFsaXplIHlvdXIgd29ya2luZyBkaXJlY3RvcnkuIElmIHlvdSBmb3JnZXQsIG90aGVyXG5jb21tYW5kcyB3aWxsIGRldGVjdCBpdCBhbmQgcmVtaW5kIHlvdSB0byBkbyBzbyBpZiBuZWNlc3NhcnkuXHUwMDFiWzBtXG50ZXJyYWZvcm0gcGxhbiAtdmFyLWZpbGU9Y29uZmlndXJhdGlvbi50ZnZhcnMgLS1vdXQ9dGYucGxhblxuXHUwMDFiWzBtXHUwMDFiWzFtYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldC5weXBpX2FwaV90b2tlbjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czpzZWNyZXRzbWFuYWdlcjp1cy13ZXN0LTE6OTkwNDY2NzQ4MDQ1OnNlY3JldDpfZ2l0aHViX2NvbnRyb2xfX1BZUElfQVBJX1RPS0VOLWRoSUk5UF1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbWRhdGEuYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldF92ZXJzaW9uLnB5cGlfYXBpX3Rva2VuOiBSZWFkaW5nLi4uXHUwMDFiWzBtXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1naXRodWJfbWVtYmVyc2hpcC5pbmZyYWhvdXNlW1wiYWt1em1pbnNreVwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZTpha3V6bWluc2t5XVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtZ2l0aHViX3RlYW0uZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1XVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtZ2l0aHViX29yZ2FuaXphdGlvbl9zZXR0aW5ncy5pbmZyYWhvdXNlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD0xMjE5ODQyNjNdXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1kYXRhLmF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXRfdmVyc2lvbi5weXBpX2FwaV90b2tlbjogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9YXJuOmF3czpzZWNyZXRzbWFuYWdlcjp1cy13ZXN0LTE6OTkwNDY2NzQ4MDQ1OnNlY3JldDpfZ2l0aHViX2NvbnRyb2xfX1BZUElfQVBJX1RPS0VOLWRoSUk5UHxBV1NDVVJSRU5UXVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnB5cGlfYXBpX3Rva2VuW1wiaW5mcmFob3VzZS10b29sa2l0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXRvb2xraXQ6UFlQSV9BUElfVE9LRU5dXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUucmVwb3NbXCJpbmZyYWhvdXNlLXRvb2xraXRcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS10b29sa2l0XVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLnJlcG9zW1wiY29va2llY3V0dGVyLWdpdGh1Yi1jb250cm9sXCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWNvb2tpZWN1dHRlci1naXRodWItY29udHJvbF1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbWdpdGh1Yl90ZWFtX21lbWJlcnMuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1XVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS10b29sa2l0XCJdLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1OmluZnJhaG91c2UtdG9vbGtpdF1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5yZXBvc1tcImNvb2tpZWN1dHRlci1naXRodWItY29udHJvbFwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTpjb29raWVjdXR0ZXItZ2l0aHViLWNvbnRyb2xdXHUwMDFiWzBtXG5cblRlcnJhZm9ybSB1c2VkIHRoZSBzZWxlY3RlZCBwcm92aWRlcnMgdG8gZ2VuZXJhdGUgdGhlIGZvbGxvd2luZyBleGVjdXRpb25cbnBsYW4uIFJlc291cmNlIGFjdGlvbnMgYXJlIGluZGljYXRlZCB3aXRoIHRoZSBmb2xsb3dpbmcgc3ltYm9sczpcbiAgXHUwMDFiWzMybStcdTAwMWJbMG0gY3JlYXRlXG4gIFx1MDAxYlszM21+XHUwMDFiWzBtIHVwZGF0ZSBpbi1wbGFjZVxuICBcdTAwMWJbMzFtLVx1MDAxYlswbSBkZXN0cm95XG5cdTAwMWJbMG1cblRlcnJhZm9ybSB3aWxsIHBlcmZvcm0gdGhlIGZvbGxvd2luZyBhY3Rpb25zOlxuXG5cdTAwMWJbMW0gICMgbW9kdWxlLnJlcG9zW1wiY29va2llY3V0dGVyLWdpdGh1Yi1jb250cm9sXCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG9cdTAwMWJbMG0gd2lsbCBiZSBcdTAwMWJbMW1cdTAwMWJbMzFtZGVzdHJveWVkXHUwMDFiWzBtXG4gICMgKGJlY2F1c2UgbW9kdWxlLnJlcG9zW1wiY29va2llY3V0dGVyLWdpdGh1Yi1jb250cm9sXCJdIGlzIG5vdCBpbiBjb25maWd1cmF0aW9uKVx1MDAxYlswbVxuXHUwMDFiWzBtICBcdTAwMWJbMzFtLVx1MDAxYlswbVx1MDAxYlswbSByZXNvdXJjZSBcImdpdGh1Yl9yZXBvc2l0b3J5XCIgXCJyZXBvXCIge1xuICAgICAgXHUwMDFiWzMxbS1cdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtYWxsb3dfYXV0b19tZXJnZVx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgID0gZmFsc2UgXHUwMDFiWzkwbS0+XHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYls5MG1udWxsXHUwMDFiWzBtXHUwMDFiWzBtXG4gICAgICBcdTAwMWJbMzFtLVx1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1hbGxvd19tZXJnZV9jb21taXRcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgPSB0cnVlIFx1MDAxYls5MG0tPlx1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbOTBtbnVsbFx1MDAxYlswbVx1MDAxYlswbVxuICAgICAgXHUwMDFiWzMxbS1cdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtYWxsb3dfcmViYXNlX21lcmdlXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgID0gdHJ1ZSBcdTAwMWJbOTBtLT5cdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzkwbW51bGxcdTAwMWJbMG1cdTAwMWJbMG1cbiAgICAgIFx1MDAxYlszMW0tXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWFsbG93X3NxdWFzaF9tZXJnZVx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICA9IHRydWUgXHUwMDFiWzkwbS0+XHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYls5MG1udWxsXHUwMDFiWzBtXHUwMDFiWzBtXG4gICAgICBcdTAwMWJbMzFtLVx1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1hbGxvd191cGRhdGVfYnJhbmNoXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgPSBmYWxzZSBcdTAwMWJbOTBtLT5cdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzkwbW51bGxcdTAwMWJbMG1cdTAwMWJbMG1cbiAgICAgIFx1MDAxYlszMW0tXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWFyY2hpdmVkXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgICAgICA9IGZhbHNlIFx1MDAxYls5MG0tPlx1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbOTBtbnVsbFx1MDAxYlswbVx1MDAxYlswbVxuICAgICAgXHUwMDFiWzMxbS1cdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtZGVmYXVsdF9icmFuY2hcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgID0gXCJtYWluXCIgXHUwMDFiWzkwbS0+XHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYls5MG1udWxsXHUwMDFiWzBtXHUwMDFiWzBtXG4gICAgICBcdTAwMWJbMzFtLVx1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1kZWxldGVfYnJhbmNoX29uX21lcmdlXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgPSBmYWxzZSBcdTAwMWJbOTBtLT5cdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzkwbW51bGxcdTAwMWJbMG1cdTAwMWJbMG1cbiAgICAgIFx1MDAxYlszMW0tXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWRlc2NyaXB0aW9uXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgICA9IFwiVGVtcGxhdGUgZm9yIGEgR2l0SHViIENvbnRyb2wgcmVwb3NpdG9yeVwiIFx1MDAxYls5MG0tPlx1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbOTBtbnVsbFx1MDAxYlswbVx1MDAxYlswbVxuICAgICAgXHUwMDFiWzMxbS1cdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtZXRhZ1x1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgICAgICAgICAgID0gXCJXL1xcXCI4YjRhNzkyYmMxNDc0ZDM4MWNhYWE2M2I3NjY2ODk5M2I0YWRjNDJhZTc2ZWQ1M2Q2ODg2ZDg1NjJlYmIwYzY3XFxcIlwiIFx1MDAxYls5MG0tPlx1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbOTBtbnVsbFx1MDAxYlswbVx1MDAxYlswbVxuICAgICAgXHUwMDFiWzMxbS1cdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtZnVsbF9uYW1lXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgICAgID0gXCJpbmZyYWhvdXNlL2Nvb2tpZWN1dHRlci1naXRodWItY29udHJvbFwiIFx1MDAxYls5MG0tPlx1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbOTBtbnVsbFx1MDAxYlswbVx1MDAxYlswbVxuICAgICAgXHUwMDFiWzMxbS1cdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtZ2l0X2Nsb25lX3VybFx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgID0gXCJnaXQ6Ly9naXRodWIuY29tL2luZnJhaG91c2UvY29va2llY3V0dGVyLWdpdGh1Yi1jb250cm9sLmdpdFwiIFx1MDAxYls5MG0tPlx1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbOTBtbnVsbFx1MDAxYlswbVx1MDAxYlswbVxuICAgICAgXHUwMDFiWzMxbS1cdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtaGFzX2Rpc2N1c3Npb25zXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgID0gZmFsc2UgXHUwMDFiWzkwbS0+XHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYls5MG1udWxsXHUwMDFiWzBtXHUwMDFiWzBtXG4gICAgICBcdTAwMWJbMzFtLVx1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1oYXNfZG93bmxvYWRzXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgPSBmYWxzZSBcdTAwMWJbOTBtLT5cdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzkwbW51bGxcdTAwMWJbMG1cdTAwMWJbMG1cbiAgICAgIFx1MDAxYlszMW0tXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWhhc19pc3N1ZXNcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICAgICA9IHRydWUgXHUwMDFiWzkwbS0+XHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYls5MG1udWxsXHUwMDFiWzBtXHUwMDFiWzBtXG4gICAgICBcdTAwMWJbMzFtLVx1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1oYXNfcHJvamVjdHNcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICAgPSBmYWxzZSBcdTAwMWJbOTBtLT5cdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzkwbW51bGxcdTAwMWJbMG1cdTAwMWJbMG1cbiAgICAgIFx1MDAxYlszMW0tXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWhhc193aWtpXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgICAgICA9IGZhbHNlIFx1MDAxYls5MG0tPlx1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbOTBtbnVsbFx1MDAxYlswbVx1MDAxYlswbVxuICAgICAgXHUwMDFiWzMxbS1cdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtaHRtbF91cmxcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICAgICAgID0gXCJodHRwczovL2dpdGh1Yi5jb20vaW5mcmFob3VzZS9jb29raWVjdXR0ZXItZ2l0aHViLWNvbnRyb2xcIiBcdTAwMWJbOTBtLT5cdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzkwbW51bGxcdTAwMWJbMG1cdTAwMWJbMG1cbiAgICAgIFx1MDAxYlszMW0tXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWh0dHBfY2xvbmVfdXJsXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICA9IFwiaHR0cHM6Ly9naXRodWIuY29tL2luZnJhaG91c2UvY29va2llY3V0dGVyLWdpdGh1Yi1jb250cm9sLmdpdFwiIFx1MDAxYls5MG0tPlx1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbOTBtbnVsbFx1MDAxYlswbVx1MDAxYlswbVxuICAgICAgXHUwMDFiWzMxbS1cdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtaWRcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICAgICAgICAgICAgID0gXCJjb29raWVjdXR0ZXItZ2l0aHViLWNvbnRyb2xcIiBcdTAwMWJbOTBtLT5cdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzkwbW51bGxcdTAwMWJbMG1cdTAwMWJbMG1cbiAgICAgIFx1MDAxYlszMW0tXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWlzX3RlbXBsYXRlXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgICA9IGZhbHNlIFx1MDAxYls5MG0tPlx1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbOTBtbnVsbFx1MDAxYlswbVx1MDAxYlswbVxuICAgICAgXHUwMDFiWzMxbS1cdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtbWVyZ2VfY29tbWl0X21lc3NhZ2VcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgID0gXCJQUl9USVRMRVwiIFx1MDAxYls5MG0tPlx1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbOTBtbnVsbFx1MDAxYlswbVx1MDAxYlswbVxuICAgICAgXHUwMDFiWzMxbS1cdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtbWVyZ2VfY29tbWl0X3RpdGxlXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgID0gXCJNRVJHRV9NRVNTQUdFXCIgXHUwMDFiWzkwbS0+XHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYls5MG1udWxsXHUwMDFiWzBtXHUwMDFiWzBtXG4gICAgICBcdTAwMWJbMzFtLVx1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1uYW1lXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgICAgICAgICAgPSBcImNvb2tpZWN1dHRlci1naXRodWItY29udHJvbFwiIFx1MDAxYls5MG0tPlx1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbOTBtbnVsbFx1MDAxYlswbVx1MDAxYlswbVxuICAgICAgXHUwMDFiWzMxbS1cdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtbm9kZV9pZFx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgICAgICAgID0gXCJSX2tnRE9JNTI4emdcIiBcdTAwMWJbOTBtLT5cdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzkwbW51bGxcdTAwMWJbMG1cdTAwMWJbMG1cbiAgICAgIFx1MDAxYlszMW0tXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbXByaXZhdGVcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICAgICAgICA9IGZhbHNlIFx1MDAxYls5MG0tPlx1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbOTBtbnVsbFx1MDAxYlswbVx1MDAxYlswbVxuICAgICAgXHUwMDFiWzMxbS1cdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtcmVwb19pZFx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgICAgICAgID0gNTk3NTQwMDQ2IFx1MDAxYls5MG0tPlx1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbOTBtbnVsbFx1MDAxYlswbVx1MDAxYlswbVxuICAgICAgXHUwMDFiWzMxbS1cdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtc3F1YXNoX21lcmdlX2NvbW1pdF9tZXNzYWdlXHUwMDFiWzBtXHUwMDFiWzBtID0gXCJDT01NSVRfTUVTU0FHRVNcIiBcdTAwMWJbOTBtLT5cdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzkwbW51bGxcdTAwMWJbMG1cdTAwMWJbMG1cbiAgICAgIFx1MDAxYlszMW0tXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbXNxdWFzaF9tZXJnZV9jb21taXRfdGl0bGVcdTAwMWJbMG1cdTAwMWJbMG0gICA9IFwiQ09NTUlUX09SX1BSX1RJVExFXCIgXHUwMDFiWzkwbS0+XHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYls5MG1udWxsXHUwMDFiWzBtXHUwMDFiWzBtXG4gICAgICBcdTAwMWJbMzFtLVx1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1zc2hfY2xvbmVfdXJsXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgPSBcImdpdEBnaXRodWIuY29tOmluZnJhaG91c2UvY29va2llY3V0dGVyLWdpdGh1Yi1jb250cm9sLmdpdFwiIFx1MDAxYls5MG0tPlx1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbOTBtbnVsbFx1MDAxYlswbVx1MDAxYlswbVxuICAgICAgXHUwMDFiWzMxbS1cdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtc3ZuX3VybFx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgICAgICAgID0gXCJodHRwczovL2dpdGh1Yi5jb20vaW5mcmFob3VzZS9jb29raWVjdXR0ZXItZ2l0aHViLWNvbnRyb2xcIiBcdTAwMWJbOTBtLT5cdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzkwbW51bGxcdTAwMWJbMG1cdTAwMWJbMG1cbiAgICAgIFx1MDAxYlszMW0tXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbXRvcGljc1x1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgICAgICAgICA9IFtdIFx1MDAxYls5MG0tPlx1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbOTBtbnVsbFx1MDAxYlswbVx1MDAxYlswbVxuICAgICAgXHUwMDFiWzMxbS1cdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtdmlzaWJpbGl0eVx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgICAgID0gXCJwdWJsaWNcIiBcdTAwMWJbOTBtLT5cdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzkwbW51bGxcdTAwMWJbMG1cdTAwMWJbMG1cbiAgICAgIFx1MDAxYlszMW0tXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbXZ1bG5lcmFiaWxpdHlfYWxlcnRzXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICA9IGZhbHNlIFx1MDAxYls5MG0tPlx1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbOTBtbnVsbFx1MDAxYlswbVx1MDAxYlswbVxuXG4gICAgICBcdTAwMWJbMzFtLVx1MDAxYlswbSBcdTAwMWJbMG1zZWN1cml0eV9hbmRfYW5hbHlzaXMge1xuXG4gICAgICAgICAgXHUwMDFiWzMxbS1cdTAwMWJbMG0gXHUwMDFiWzBtc2VjcmV0X3NjYW5uaW5nIHtcbiAgICAgICAgICAgICAgXHUwMDFiWzMxbS1cdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtc3RhdHVzXHUwMDFiWzBtXHUwMDFiWzBtID0gXCJkaXNhYmxlZFwiIFx1MDAxYls5MG0tPlx1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbOTBtbnVsbFx1MDAxYlswbVx1MDAxYlswbVxuICAgICAgICAgICAgfVxuXG4gICAgICAgICAgXHUwMDFiWzMxbS1cdTAwMWJbMG0gXHUwMDFiWzBtc2VjcmV0X3NjYW5uaW5nX3B1c2hfcHJvdGVjdGlvbiB7XG4gICAgICAgICAgICAgIFx1MDAxYlszMW0tXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbXN0YXR1c1x1MDAxYlswbVx1MDAxYlswbSA9IFwiZGlzYWJsZWRcIiBcdTAwMWJbOTBtLT5cdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzkwbW51bGxcdTAwMWJbMG1cdTAwMWJbMG1cbiAgICAgICAgICAgIH1cbiAgICAgICAgfVxuICAgIH1cblxuXHUwMDFiWzFtICAjIG1vZHVsZS5yZXBvc1tcImNvb2tpZWN1dHRlci1naXRodWItY29udHJvbFwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldlx1MDAxYlswbSB3aWxsIGJlIFx1MDAxYlsxbVx1MDAxYlszMW1kZXN0cm95ZWRcdTAwMWJbMG1cbiAgIyAoYmVjYXVzZSBtb2R1bGUucmVwb3NbXCJjb29raWVjdXR0ZXItZ2l0aHViLWNvbnRyb2xcIl0gaXMgbm90IGluIGNvbmZpZ3VyYXRpb24pXHUwMDFiWzBtXG5cdTAwMWJbMG0gIFx1MDAxYlszMW0tXHUwMDFiWzBtXHUwMDFiWzBtIHJlc291cmNlIFwiZ2l0aHViX3RlYW1fcmVwb3NpdG9yeVwiIFwiZGV2XCIge1xuICAgICAgXHUwMDFiWzMxbS1cdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtZXRhZ1x1MDAxYlswbVx1MDAxYlswbSAgICAgICA9IFwiVy9cXFwiODA0M2Y4MWIxOTY5M2Y2YzFhNzJkMjFiYjhkYzAzODU5Yzk4YmY3OGJmYmU3OTc4MmJmZTEzZmE4MTM5OTJjYVxcXCJcIiBcdTAwMWJbOTBtLT5cdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzkwbW51bGxcdTAwMWJbMG1cdTAwMWJbMG1cbiAgICAgIFx1MDAxYlszMW0tXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWlkXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgPSBcIjczMzI4MTU6Y29va2llY3V0dGVyLWdpdGh1Yi1jb250cm9sXCIgXHUwMDFiWzkwbS0+XHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYls5MG1udWxsXHUwMDFiWzBtXHUwMDFiWzBtXG4gICAgICBcdTAwMWJbMzFtLVx1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1wZXJtaXNzaW9uXHUwMDFiWzBtXHUwMDFiWzBtID0gXCJwdXNoXCIgXHUwMDFiWzkwbS0+XHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYls5MG1udWxsXHUwMDFiWzBtXHUwMDFiWzBtXG4gICAgICBcdTAwMWJbMzFtLVx1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1yZXBvc2l0b3J5XHUwMDFiWzBtXHUwMDFiWzBtID0gXCJjb29raWVjdXR0ZXItZ2l0aHViLWNvbnRyb2xcIiBcdTAwMWJbOTBtLT5cdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzkwbW51bGxcdTAwMWJbMG1cdTAwMWJbMG1cbiAgICAgIFx1MDAxYlszMW0tXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbXRlYW1faWRcdTAwMWJbMG1cdTAwMWJbMG0gICAgPSBcIjczMzI4MTVcIiBcdTAwMWJbOTBtLT5cdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzkwbW51bGxcdTAwMWJbMG1cdTAwMWJbMG1cbiAgICB9XG5cblx1MDAxYlsxbSAgIyBtb2R1bGUucmVwb3NbXCJpbmZyYWhvdXNlLXRvb2xraXRcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwb1x1MDAxYlswbSB3aWxsIGJlIHVwZGF0ZWQgaW4tcGxhY2VcdTAwMWJbMG1cdTAwMWJbMG1cblx1MDAxYlswbSAgXHUwMDFiWzMzbX5cdTAwMWJbMG1cdTAwMWJbMG0gcmVzb3VyY2UgXCJnaXRodWJfcmVwb3NpdG9yeVwiIFwicmVwb1wiIHtcbiAgICAgIFx1MDAxYlszM21+XHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWRlc2NyaXB0aW9uXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgICA9IFwiSW5mcmFIb3VzZSBUb29sa2l0XCIgXHUwMDFiWzMzbS0+XHUwMDFiWzBtIFx1MDAxYlswbVwiSW5mcmFIb3VzZSBUb29sa2l0MVwiXG4gICAgICAgIFx1MDAxYlsxbVx1MDAxYlswbWlkXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgICAgICAgICAgICA9IFwiaW5mcmFob3VzZS10b29sa2l0XCJcbiAgICAgICAgXHUwMDFiWzFtXHUwMDFiWzBtbmFtZVx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgICAgICAgICAgID0gXCJpbmZyYWhvdXNlLXRvb2xraXRcIlxuICAgICAgICBcdTAwMWJbOTBtIyAoMzEgdW5jaGFuZ2VkIGF0dHJpYnV0ZXMgaGlkZGVuKVx1MDAxYlswbVx1MDAxYlswbVxuXG4gICAgICAgIFx1MDAxYls5MG0jICgxIHVuY2hhbmdlZCBibG9jayBoaWRkZW4pXHUwMDFiWzBtXHUwMDFiWzBtXG4gICAgfVxuXG5cdTAwMWJbMW0gICMgbW9kdWxlLnJlcG9zW1widGVzdFwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvXHUwMDFiWzBtIHdpbGwgYmUgY3JlYXRlZFx1MDAxYlswbVx1MDAxYlswbVxuXHUwMDFiWzBtICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSByZXNvdXJjZSBcImdpdGh1Yl9yZXBvc2l0b3J5XCIgXCJyZXBvXCIge1xuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtYWxsb3dfYXV0b19tZXJnZVx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgID0gZmFsc2VcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWFsbG93X21lcmdlX2NvbW1pdFx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICA9IHRydWVcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWFsbG93X3JlYmFzZV9tZXJnZVx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICA9IHRydWVcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWFsbG93X3NxdWFzaF9tZXJnZVx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICA9IHRydWVcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWFyY2hpdmVkXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgICAgICA9IGZhbHNlXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1kZWZhdWx0X2JyYW5jaFx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1kZWxldGVfYnJhbmNoX29uX21lcmdlXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgPSBmYWxzZVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtZGVzY3JpcHRpb25cdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICAgID0gXCJUZW1wbGF0ZSBmb3IgYSBHaXRIdWIgQ29udHJvbCByZXBvc2l0b3J5XCJcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWV0YWdcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWZ1bGxfbmFtZVx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWdpdF9jbG9uZV91cmxcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWhhc19pc3N1ZXNcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICAgICA9IHRydWVcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWh0bWxfdXJsXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWh0dHBfY2xvbmVfdXJsXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWlkXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbW1lcmdlX2NvbW1pdF9tZXNzYWdlXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICA9IFwiUFJfVElUTEVcIlxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtbWVyZ2VfY29tbWl0X3RpdGxlXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgID0gXCJNRVJHRV9NRVNTQUdFXCJcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbW5hbWVcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICAgICAgICAgICA9IFwidGVzdFwiXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1ub2RlX2lkXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1wcml2YXRlXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1yZXBvX2lkXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1zcXVhc2hfbWVyZ2VfY29tbWl0X21lc3NhZ2VcdTAwMWJbMG1cdTAwMWJbMG0gPSBcIkNPTU1JVF9NRVNTQUdFU1wiXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1zcXVhc2hfbWVyZ2VfY29tbWl0X3RpdGxlXHUwMDFiWzBtXHUwMDFiWzBtICAgPSBcIkNPTU1JVF9PUl9QUl9USVRMRVwiXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1zc2hfY2xvbmVfdXJsXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1zdm5fdXJsXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG12aXNpYmlsaXR5XHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgICAgPSBcInB1YmxpY1wiXG5cbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbXNlY3VyaXR5X2FuZF9hbmFseXNpcyB7XG4gICAgICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtYWR2YW5jZWRfc2VjdXJpdHkge1xuICAgICAgICAgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1zdGF0dXNcdTAwMWJbMG1cdTAwMWJbMG0gPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICAgICAgICB9XG5cbiAgICAgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1zZWNyZXRfc2Nhbm5pbmcge1xuICAgICAgICAgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1zdGF0dXNcdTAwMWJbMG1cdTAwMWJbMG0gPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICAgICAgICB9XG5cbiAgICAgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1zZWNyZXRfc2Nhbm5pbmdfcHVzaF9wcm90ZWN0aW9uIHtcbiAgICAgICAgICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtc3RhdHVzXHUwMDFiWzBtXHUwMDFiWzBtID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgICAgICAgfVxuICAgICAgICB9XG4gICAgfVxuXG5cdTAwMWJbMW0gICMgbW9kdWxlLnJlcG9zW1widGVzdFwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldlx1MDAxYlswbSB3aWxsIGJlIGNyZWF0ZWRcdTAwMWJbMG1cdTAwMWJbMG1cblx1MDAxYlswbSAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gcmVzb3VyY2UgXCJnaXRodWJfdGVhbV9yZXBvc2l0b3J5XCIgXCJkZXZcIiB7XG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1ldGFnXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtaWRcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbXBlcm1pc3Npb25cdTAwMWJbMG1cdTAwMWJbMG0gPSBcInB1c2hcIlxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtcmVwb3NpdG9yeVx1MDAxYlswbVx1MDAxYlswbSA9IFwidGVzdFwiXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG10ZWFtX2lkXHUwMDFiWzBtXHUwMDFiWzBtICAgID0gXCI3MzMyODE1XCJcbiAgICB9XG5cblx1MDAxYlswbVx1MDAxYlsxbVBsYW46XHUwMDFiWzBtIDIgdG8gYWRkLCAxIHRvIGNoYW5nZSwgMiB0byBkZXN0cm95LlxuXHUwMDFiWzBtXHUwMDFiWzkwbVxuXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUwMDFiWzBtXG5cblNhdmVkIHRoZSBwbGFuIHRvOiB0Zi5wbGFuXG5cblRvIHBlcmZvcm0gZXhhY3RseSB0aGVzZSBhY3Rpb25zLCBydW4gdGhlIGZvbGxvd2luZyBjb21tYW5kIHRvIGFwcGx5OlxuICAgIHRlcnJhZm9ybSBhcHBseSBcInRmLnBsYW5cIlxuIiwgInN0ZGVyciI6IG51bGwsICJhZGQiOiAyLCAiY2hhbmdlIjogMSwgImRlc3Ryb3kiOiAyfX0=```
</p></details>